import numpy as np

#初始化网络：模型参数的初始化（权重W和偏置b）
def init_network():
    network = {}
    #第一层参数 : 该层有三个神经元，且上一层是输入层（第零层）是两个输入特征x1,x2，即可得到一个2*3的矩阵，具体公式查看《2.神经网络基础》-> 神经网路的简单实现 ->代码实现
    network['W1'] = np.array([[0.1,0.3,0.5],[0.2,0.4,0.6]])
    network['b1'] = np.array([0.1,0.2,0.3])

    #第二层数：该层有两个神经元，且上一层是三个神经元，即可得到一个3*2的矩阵
    network['W2'] = np.array([[0.1,0.4],[0.2,0.5],[0.3,0.6]])
    network['b2'] = np.array([0.1,0.2])

    #第三层数：该层是输出层，有两个数据y1 y2，且上一次是两个神经元，即可得到一个2*2的矩阵
    network['W3'] = np.array([[0.1,0.3],[0.2,0.4]])
    network['b3'] = np.array([0.1,0.2])



